const { EmbedBuilder } = require("discord.js");

async function prizes(interaction) {
  const embed = new EmbedBuilder()
    .setDescription(
      `每有队伍前进5000步,根据内人的步数和道具使用判定贡献值，根据贡献值抽取奖池算节后个人贡献步数归零\n

⚪ **__白色奖品__**
- 🥚 臭鸡蛋 (100)
- 🪙 金币 100枚 (无限)
- 🪙 金币 500枚 (无限)
- 📜 1%返利券
- 📜 1%陪玩分成一周 最高积累8张
- ❤️ 温馨信息

🟢 **__绿色奖品__**
- 🌹 玫瑰 (100)
- 💸 5刀优惠券 (50)
- 🍺 啤酒 (30)
- 🪙 金币 1000枚 (无限)
- 🪙 金币 5000枚 (无限)
- 📜 2%陪玩分成一周 最高积累8张
- 📜 2%返利券 (最高返利200)

🔵 **__蓝色奖品__**
- 🎁 圣诞礼物第二个 (25)
- 🎁 圣诞礼物第一个 (12)
- 💸 10刀优惠券 (50)
- 🚀 Discord Nitro会员 (20)
- 📜 3%陪玩分成一周 最高积累8张
- 📜 3%返利券 (最高返利200)
- 🚶‍♀️ 独立下单区一月 (5)

🟠 **__橙色奖品__**
- 💮 琼华露 (2)
- 🍰 星座蛋糕 (12)
- 🍾 洛桑酒 (3)
- 🪙 金币 10000枚 (无限)
- 📜 4%陪玩分成一周 最高积累8张
- 📜 4%返利券 (最高返利200)
- 💸 50代金券 (4)

🔴 **__红色奖品__**
- 🍹 龙舌兰 (1)
- 🍷 百花酿 (1)
- 📜 5%陪玩分成一周
- 📜 5%返利券 (最高返利200)
- 💎 300宝石 (无限)
- 💸 100代金券 (2)
        
        



.................................⚪...................🟢.....................🔵................🟠.....................🔴           

        **300步以内**...........**60%**..................**30%**...................**10%**................**0%**......................**0%**

        **600步以内**...........**45%**..................**35%**...................**15%**................**5%**......................**0%**

        **900步以内**...........**40%**..................**30%**...................**20%**................**5%**.....................**1%**

        **1200步以内**..........**35%**..................**25%**...................**20%**................**17%**......................**3%**

        **1200步以上**..........**25%**..................**20%**...................**25%**................**25%**....................**5%**

        `
    )
    .setColor("#FFD700")
    .setTitle(
      "礼物池: 总价值 $4881.6 (未计算金币宝石，返利券，陪玩分成，礼物池有数量计算的礼物抽完即算）"
    );
  await interaction.reply({ embeds: [embed], ephemeral: true });
}

module.exports = prizes;
